/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   corewar.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ljacquet <ljacquet@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/10 11:56:21 by ljacquet          #+#    #+#             */
/*   Updated: 2020/12/18 14:48:30 by ljacquet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "corwar.h"

//Эта операция берет значение из регистра, который был передан в качестве
// единственного аргумента. Приводит его к типу char. И выводит на экран как ASCII-символ.
//Циклы до исполнения 2

void				aff(t_cor *vm, t_process *proc)
{
	//переменные
	// char - значение из регистра

	//движение дальше
	//шаг курсора - прибавляем стандартный

	//получение данных
	// значение из регистра, который был передан в качестве
	// единственного аргумента. Приводим его к типу char aff_symbol = (char)value;									DIR_SIZE);

	//печать - если есть флаг а
	//if (vm->display_aff)
	//		ft_printf("Aff: %c\n", (char)value);
}