/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   corewar.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ljacquet <ljacquet@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/10 11:56:21 by ljacquet          #+#    #+#             */
/*   Updated: 2020/12/18 14:48:30 by ljacquet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "corwar.h"
#include "g_corewar_op.h"

//делает копию каретки. И эту копию размещает по адресу <ПЕРВЫЙ_АРГУМЕНТ> % IDX_MOD.
// Размер T_DIR 2.
//Циклы до исполнения 800

void				g_fork(t_cor *vm, t_process *proc)
{
	// переменные
	// адрес куда копировать каретку

	//движение дальше
	//шаг курсора - прибавляем стандартный

	//получение данных
	//аргумент (1)
	// вычисляем адрес текущая позиция + <ПЕРВЫЙ_АРГУМЕНТ> % IDX_MOD.

	//изменения в структуре каретки
	//копируем всю каретку и размещаем копию по новому адресу

	//изменения в общей структуре vm
	//увеличиваем счетчик кареток

	//печать
	// ft_printf("P %4d | fork %d (%d)\n",
	//										cursor->id,
	//										addr,
	//										cursor->pc + addr % IDX_MOD)
}