/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   corewar.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ljacquet <ljacquet@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/10 11:56:21 by ljacquet          #+#    #+#             */
/*   Updated: 2020/12/18 14:48:30 by ljacquet         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../includes/corwar.h"
#include "../../includes/g_corewar_op.h"

//записывает значение, полученное из первого аргумента, в регистр, переданный
// как второй аргумент. Но если T_IND, то в этой операции мы будем считывать 4 байта
// значения по адресу — текущая позиция + <ПЕРВЫЙ_АРГУМЕНТ>. Не применяя усечение по модулю
// Оригинальная виртуальная машина corewar, к сожалению, работает неправильно. И считывает 2 байта, а не 4.
//Циклы до исполнения 10

void				lld(t_cor *cor, t_process *proc)
{
	uint8_t			reg2;
	int32_t			value_to_reg;

	value_to_reg = get_value(cor, proc, 0);
	if (value_to_reg == MEM_SIZE + 1)
		return;
	reg2 = get_value(cor, proc, 1);
	proc->reg[reg2 - 1] = value_to_reg;
	if (value_to_reg == 0)
		proc->carry = 1;
	else
		proc->carry = 0;
}